Catalogs/ИнвестиционныеДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ИнвестиционныеДекларации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консолидирующая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМинимальноеЗначениеРейтинга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЦелевоеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастиеВГолосовании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнвестиционнойДекларации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовокупныйКонтроль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Базис</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазисыКонтроляИнвестиционныхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролируемыйПоказатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаМин</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаМакс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъединятьОтборы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборИнвестиционнойДекларации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыИнвестиционныхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвестиционнаяДекларация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевоеЗначение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаЦель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнутреннийНабор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОпределяетСоставИСтруктуру</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСКДБазиса</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МакетКомпоновки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСКДНабора</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаЭмитентов</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяФилиалы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаЦенныхБумаг</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиПоказателей</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗапретаПокупки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапасМин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапасМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыЭмитентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Эмитенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыЦенныхБумаг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИнвестиционныеДекларации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Для каждого СтрокаПоказатели Из Параметры.ЗначениеКопирования.Показатели Цикл
			Объект.Показатели[Параметры.ЗначениеКопирования.Показатели.Индекс(СтрокаПоказатели)].АдресМакетаКомпоновки = ПоместитьВоВременноеХранилище(СтрокаПоказатели.МакетКомпоновки, ЭтаФорма.УникальныйИдентификатор);
		КонецЦикла;
	КонецЕсли; 
	
	ЭтаФорма.Параметры.Свойство("ИмяФайлаЛимитнойВедомости", ЭтаФорма.ИмяФайлаЛимитнойВедомости);
	
	ПриЧтенииСозданииНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.РежимВводаСтрок = "" Тогда
		ЭтаФорма.РежимВводаСтрок = "ВКонецСписка";
	КонецЕсли; 
	
	Элемент = Элементы.Найти("ПоказателиКомандаРежимВводаСтрок" + ЭтаФорма.РежимВводаСтрок);
	Если Элемент <> Неопределено Тогда
		Элемент.Пометка = Истина;
		Элементы.Показатели.РежимВводаСтрок = РежимВводаСтрокТаблицы[ЭтаФорма.РежимВводаСтрок];
		Элементы.ПоказателиРежимВводаСтрок.Заголовок = "Режим ввода строк (" + НРег(Элемент.Заголовок) + ")";
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	ПоляЗначений = СтрРазделить("МинимальноеЗначение,МаксимальноеЗначение", ",", Ложь);
		
	Для каждого ТекСтрока Из Объект.Показатели Цикл
	
		Для каждого ПолеЗначения Из ПоляЗначений Цикл
		
			Если ТипЗнч(ТекСтрока[ПолеЗначения]) = Тип("Строка") Тогда
				ПараметрыБазиса = ПараметрыБазисов.НайтиСтроки(Новый Структура("Базис", ТекСтрока.Базис))[0]; 
				ТекСтрока[ПолеЗначения + "Форма"] = ПараметрыБазиса.ОтборКомпоновкиДанных.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ТекСтрока[ПолеЗначения])).Заголовок;
			Иначе
				ТекСтрока[ПолеЗначения + "Форма"] = ТекСтрока[ПолеЗначения];
			КонецЕсли; 
		
		КонецЦикла; 
		
		ЗаполнитьИмяГруппы(ТекСтрока, ПараметрыПолейЭмитентов);
		ЗаполнитьИмяГруппы(ТекСтрока, ПараметрыПолейЦенныхБумаг);
		ЗаполнитьОтбор(ТекСтрока, ПараметрыПолейЭмитентов);
		ЗаполнитьОтбор(ТекСтрока, ПараметрыПолейЦенныхБумаг);
		
		ТекСтрока.ЗапретПокупки = ЗначениеЗаполнено(ТекСтрока.ДатаЗапретаПокупки);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для каждого СтрокаПоказателей Из Объект.Показатели Цикл
		
		Если Не Объект.Консолидирующая Тогда
			СтрокаПоказателей.ИнвестиционнаяДекларация = Неопределено;
		КонецЕсли; 
		
		Если ТипЗнч(СтрокаПоказателей.МаксимальноеЗначение) = Тип("Число")
			И Не (СтрокаПоказателей.АбсолютнаяВеличинаМакс И СтрокаПоказателей.МаксимальноеЗначение = 0) 
			// максимальное значение равное нулю в абсолюте считаем, как "без ограничения" сверху. Проверки в этом случае не нужны
			И ((СтрокаПоказателей.АбсолютнаяВеличинаМин = СтрокаПоказателей.АбсолютнаяВеличинаМакс И СтрокаПоказателей.МинимальноеЗначение > СтрокаПоказателей.МаксимальноеЗначение)
			// сравниваем доли с долями и абсолютные величины с абсолютными
				Или (ТипЗнч(СтрокаПоказателей.МаксимальноеЗначение) = Тип("Число") И ТипЗнч(СтрокаПоказателей.МинимальноеЗначение) = Тип("Число") 
				И Не СтрокаПоказателей.АбсолютнаяВеличинаМакс И СтрокаПоказателей.МаксимальноеЗначение = 0 И СтрокаПоказателей.МинимальноеЗначение > 0)) Тогда
				// если максимальная в процентах равна 0 - минимальная тоже должна быть равна нулю
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Максимальное значение не может быть меньше минимального",, "Показатели[" + (СтрокаПоказателей.НомерСтроки - 1) + "].МаксимальноеЗначениеФорма", "Объект", Отказ);
		
		КонецЕсли; 
		
	КонецЦикла; 
	
	НайденныеСтроки = Объект.Показатели.НайтиСтроки(Новый Структура("АбсолютнаяВеличинаМакс", Ложь));
	Для каждого СтрокаНайденныеСтроки Из НайденныеСтроки Цикл
		Если ТипЗнч(СтрокаНайденныеСтроки.МаксимальноеЗначение) = Тип("Число") И СтрокаНайденныеСтроки.МаксимальноеЗначение > 100 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Максимальное значение в процентном выражении не может быть больше 100%",, "Показатели[" + (СтрокаНайденныеСтроки.НомерСтроки - 1) + "].МаксимальноеЗначениеФорма", "Объект", Отказ);
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого СтрокаПоказатели Из Объект.Показатели Цикл
		Если ЭтоАдресВременногоХранилища(СтрокаПоказатели.АдресМакетаКомпоновки) Тогда
			ТекущийОбъект.Показатели[Объект.Показатели.Индекс(СтрокаПоказатели)].МакетКомпоновки = ПолучитьИзВременногоХранилища(СтрокаПоказатели.АдресМакетаКомпоновки);
		КонецЕсли; 		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти 

#Область ОбрабочикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользоватьМинимальноеЗначениеРейтингаПриИзменении(Элемент)
	
	Элементы.Показатели.ТекущиеДанные.ИдентификаторСКДБазиса = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиБазисПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Показатели.ТекущиеДанные;
	
	БазисПриИзмененииНаСервере(ТекущиеДанные.Базис);
	ТекущиеДанные.ИдентификаторСКДБазиса = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиНаборИнвестиционнойДекларацииПриИзменении(Элемент)
	
	Элементы.Показатели.ТекущиеДанные.ИдентификаторСКДНабора = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиКонтролируемыйПоказательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Элементы.Показатели.ТекущиеДанные.ИдентификаторСКДБазиса = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиКонтролируемыйПоказательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущийБазис = Элементы.Показатели.ТекущиеДанные.Базис;
	НайденныеСтроки = ПараметрыБазисов.НайтиСтроки(Новый Структура("Базис", Элементы.Показатели.ТекущиеДанные.Базис));
	Если НайденныеСтроки.Количество() > 0 Тогда
	
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = НайденныеСтроки[0].Показатели;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура МинимальноеЗначениеФормаПриИзменении(Элемент)
	ТекСтрока = Элементы.Показатели.ТекущиеДанные;
	Если ТипЗнч(ТекСтрока.МинимальноеЗначениеФорма) = Тип("Число") Тогда
		ТекСтрока.МинимальноеЗначение = ТекСтрока.МинимальноеЗначениеФорма;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура МаксимальноеЗначениеФормаПриИзменении(Элемент)
	ТекСтрока = Элементы.Показатели.ТекущиеДанные;
	Если ТипЗнч(ТекСтрока.МаксимальноеЗначениеФорма) = Тип("Число") Тогда
		ТекСтрока.МаксимальноеЗначение = ТекСтрока.МаксимальноеЗначениеФорма;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТолькоПросмотр Тогда
	
		Если Поле.Имя = "ПоказателиНаборИнвестиционнойДекларации" Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.НаборИнвестиционнойДекларации);
		ИначеЕсли Поле.Имя = "ПоказателиБазис" Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.Базис);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Поле.Имя = "ПоказателиОтборПоЭмитенту" Тогда 
		ОтборНачалоВыбора(Элементы.ПоказателиОтборПоЭмитенту, СтандартнаяОбработка, ЭтаФорма.ПараметрыПолейЭмитентов);
	ИначеЕсли Поле.Имя = "ПоказателиОтборПоЦеннойБумаге" Тогда 
		ОтборНачалоВыбора(Элементы.ПоказателиОтборПоЦеннойБумаге, СтандартнаяОбработка, ЭтаФорма.ПараметрыПолейЦенныхБумаг);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПриАктивизацииЯчейки(Элемент)
	
	ТекПоле = Элементы.Показатели.ТекущийЭлемент;  
	ТекСтрока = Элементы.Показатели.ТекущиеДанные;
	
	КнопкаМеню = Элементы.ПоказателиКонтекстноеМенюИспользоватьВКачествеЗначенияПоле;
	КнопкаПанели = Элементы.ПоказателиИспользоватьВКачествеЗначенияПоле;
	
	ДоступностьКнопок = Ложь;
	
	Если ТекСтрока <> Неопределено Тогда
	
		ДоступностьКнопок = (ТекПоле.Имя = "МинимальноеЗначениеФорма"
			Или ТекПоле.Имя = "МаксимальноеЗначениеФорма");
			
	КонецЕсли;
	
	КнопкаМеню.Доступность = ДоступностьКнопок;
	КнопкаПанели.Доступность = ДоступностьКнопок;
	
	Если ДоступностьКнопок Тогда
		
		КнопкаМеню.Пометка = ТипЗнч(ТекСтрока[ТекПоле.Имя]) = Тип("Строка");
		КнопкаПанели.Пометка = ТипЗнч(ТекСтрока[ТекПоле.Имя]) = Тип("Строка");
		
		ТекТипЗначения = ТипЗнч(ТекСтрока[ТекПоле.Имя]);
		
		ВычитаемыеТипы = Новый Массив;
		
		Если ТекТипЗначения = Тип("Строка") Тогда
			ВычитаемыеТипы.Добавить(Тип("Число"));
			ТекПоле.РедактированиеТекста = Ложь;
		Иначе
			ВычитаемыеТипы.Добавить(Тип("Строка"));
			ТекПоле.РедактированиеТекста = Истина;
		КонецЕсли; 
		
		ТекПоле.ОграничениеТипа = Новый ОписаниеТипов(ОписаниеТиповМаксимальногоИМинимальногоЗначения, , ВычитаемыеТипы);
		ТекСтрока[ТекПоле.Имя] = ТекПоле.ОграничениеТипа.ПривестиЗначение(ТекСтрока[ТекПоле.Имя]);
	
	Иначе
		КнопкаМеню.Пометка = Ложь;
		КнопкаПанели.Пометка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.МинимальноеЗначение = 0;
		Элемент.ТекущиеДанные.МаксимальноеЗначение = 0;
		Элемент.ТекущиеДанные.МинимальноеЗначениеФорма = 0;
		Элемент.ТекущиеДанные.МаксимальноеЗначениеФорма = 0;
	КонецЕсли; 
	Если Копирование Тогда
		Элемент.ТекущиеДанные.ИдентификаторСКДБазиса = Неопределено;
		Элемент.ТекущиеДанные.ИдентификаторСКДНабора = Неопределено;
		Элемент.ТекущиеДанные.ИдентификаторСтрокиПоказателей = Неопределено;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.Показатели.ТекущиеДанные;
	ПроверитьИдентификаторСтрокиПоказателей(Элементы.Показатели.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекущиеДанные = Элементы.Показатели.ТекущиеДанные;
	Если Не НоваяСтрока И Не ОтменаРедактирования И ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторСтрокиПоказателей) Тогда
		ПроверитьИдентификаторСтрокиПоказателей(Элементы.Показатели.ТекущиеДанные, Истина);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТипИнвестиционнойДекларацииПриИзменении(Элемент)
	НастроитьВидимостьИДоступность(ЭтаФорма)
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура("УникальныйИдентификаторВладельца, Организация, Консолидирующая", ЭтаФорма.УникальныйИдентификатор, Объект.Организация, Объект.Консолидирующая);
	АдресТаблицыПриемника = ОткрытьФормуМодально("Справочник.ИнвестиционныеДекларации.Форма.ФормаПодбораНастроек", ПараметрыФормы, ЭтаФорма);
	Если ЭтоАдресВременногоХранилища(АдресТаблицыПриемника) Тогда
		ДобавитьСтрокиНастроекИзПодбора(АдресТаблицыПриемника);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВКачествеЗначенияПоле(Команда)
	
	ЭтаФорма.Модифицированность = Истина;
	
	ТекПоле = Элементы.Показатели.ТекущийЭлемент;
	ТекСтрока = Элементы.Показатели.ТекущиеДанные;
	
	КнопкаМеню = Элементы.ПоказателиКонтекстноеМенюИспользоватьВКачествеЗначенияПоле;
	КнопкаПанели = Элементы.ПоказателиИспользоватьВКачествеЗначенияПоле;
	
	ВычитаемыеТипы = Новый Массив;
	
	Если КнопкаМеню.Пометка Тогда
		ВычитаемыеТипы.Добавить(Тип("Строка"));
		ТекПоле.РедактированиеТекста = Истина;
		ТекСтрока[ТекПоле.Имя] = 0;
	Иначе
		ВычитаемыеТипы.Добавить(Тип("Число"));
		ТекПоле.РедактированиеТекста = Ложь;
		ТекСтрока[ТекПоле.Имя] = "";
	КонецЕсли;
	
	ТекПоле.ОграничениеТипа = Новый ОписаниеТипов(ОписаниеТиповМаксимальногоИМинимальногоЗначения, , ВычитаемыеТипы);
	
	КнопкаМеню.Пометка = Не КнопкаМеню.Пометка;
	КнопкаПанели.Пометка = Не КнопкаПанели.Пометка;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаРежимВводаСтрок(Команда)
	
	Для каждого Кнопка Из Элементы.ПоказателиРежимВводаСтрок.ПодчиненныеЭлементы Цикл
	
		Если Кнопка.Имя = "Показатели" + Команда.Имя Тогда
			Кнопка.Пометка = Истина;
			ЭтаФорма.РежимВводаСтрок = СтрЗаменить(Кнопка.Имя, "ПоказателиКомандаРежимВводаСтрок", "");
			Элементы.Показатели.РежимВводаСтрок = РежимВводаСтрокТаблицы[ЭтаФорма.РежимВводаСтрок];
			Элементы.ПоказателиРежимВводаСтрок.Заголовок = "Режим ввода строк (" + НРег(Кнопка.Заголовок) + ")";
		Иначе
			Кнопка.Пометка = Ложь;
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНесоответствияИД()

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НесоответствияИнвестиционнымДекларациям.ИдентификаторСтрокиПоказателей КАК ИдентификаторСтрокиПоказателей,
		|	НесоответствияИнвестиционнымДекларациям.Регистратор КАК Регистратор
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НесоответствияИнвестиционнымДекларациям КАК НесоответствияИнвестиционнымДекларациям
		|		ПО ИнвестиционныеДекларацииПоказатели.ИдентификаторСтрокиПоказателей = НесоответствияИнвестиционнымДекларациям.ИдентификаторСтрокиПоказателей
		|			И ИнвестиционныеДекларацииПоказатели.Ссылка = НесоответствияИнвестиционнымДекларациям.ИнвестиционнаяДекларация
		|			И (НесоответствияИнвестиционнымДекларациям.Активность = ИСТИНА)
		|			И (ИнвестиционныеДекларацииПоказатели.Ссылка = &Ссылка)
		|ИТОГИ ПО
		|	ИдентификаторСтрокиПоказателей";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	ВыборкаИдентификатор = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИдентификатор.Следующий() Цикл
	
		СтрокаПоказателей = Объект.Показатели.НайтиСтроки(Новый Структура("ИдентификаторСтрокиПоказателей", ВыборкаИдентификатор.ИдентификаторСтрокиПоказателей))[0];
		Выборка = ВыборкаИдентификатор.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаПоказателей.НесоответствиеИнвестиционнойДекларации.Добавить(Выборка.Регистратор);
		КонецЦикла; 
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИдентификаторСтрокиПоказателей(СтрокаПоказателей, ПолучитьИсходныеЗначенияРеквизитов = Ложь)
	
	КлючевыеРеквизиты = Новый Структура("Базис, КонтролируемыйПоказатель, МинимальноеЗначение, МаксимальноеЗначение, АбсолютнаяВеличинаМин, АбсолютнаяВеличинаМакс,
		|ОбъединятьОтборы, НаборИнвестиционнойДекларации, ИнвестиционнаяДекларация, Эмитент, ГруппаЭмитентов, ВключаяФилиалы, ЦеннаяБумага, ГруппаЦенныхБумаг, ИдентификаторСтрокиПоказателей");
	ЗаполнитьЗначенияСвойств(КлючевыеРеквизиты, СтрокаПоказателей);
	Если Не ПолучитьИсходныеЗначенияРеквизитов Или ИзменилисьКлючевыеРеквизиты(Объект.Ссылка, КлючевыеРеквизиты) Тогда
		ЕстьСсылки = ЗначениеЗаполнено(СтрокаПоказателей.НесоответствиеИнвестиционнойДекларации);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменилисьКлючевыеРеквизиты(Ссылка, КлючевыеРеквизиты)

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	1 КАК Поле
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
		|ГДЕ
		|	ИнвестиционныеДекларацииПоказатели.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Для каждого КЗ Из КлючевыеРеквизиты Цикл
		
		ОтборПоКлючевомуРеквизиту = СтрШаблон("И ИнвестиционныеДекларацииПоказатели.%1 = &%1", КЗ.Ключ);
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + Символы.Таб + ОтборПоКлючевомуРеквизиту;
		Запрос.УстановитьПараметр(КЗ.Ключ, КЗ.Значение);
	
	КонецЦикла; 
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Пустой();

КонецФункции
 
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПараметрыБазиса(СтрокаБазиса, Базис)

	Если ЗначениеЗаполнено(Базис) Тогда
		
		ТаблицаПоказателей = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьОписаниеКонтролируемыхПоказателей(Базис.НаборДанных);
		СтрокаБазиса.Показатели.Очистить();
		
		Для каждого Показатель Из ТаблицаПоказателей Цикл
		
			СтрокаБазиса.Показатели.Добавить(Показатель.Представление);
		
		КонецЦикла; 
		
		СтрокаБазиса.Базис = Базис;
		
		СКД = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьСКДБазиса(Базис.НаборДанных);
		Если ТипЗнч(СКД) = Тип("СхемаКомпоновкиДанных") Тогда
			АдресСКД = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
			Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
			Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
			СтрокаБазиса.ОтборКомпоновкиДанных = Компоновщик.Настройки.Отбор;
			УдалитьИзВременногоХранилища(АдресСКД);
		КонецЕсли;
		
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура БазисПриИзмененииНаСервере(Базис) Экспорт

	НайденныеСтроки = ПараметрыБазисов.НайтиСтроки(Новый Структура("Базис", Базис));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаБазиса = ПараметрыБазисов.Добавить();
	Иначе
		СтрокаБазиса = НайденныеСтроки[0];
	КонецЕсли; 
	
	ЗаполнитьПараметрыБазиса(СтрокаБазиса, Базис);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Базисы = Объект.Показатели.Выгрузить(, "Базис");
	Базисы.Свернуть("Базис");
	
	Для каждого ТекСтрока Из Базисы Цикл
	
		СтрокаБазиса = ПараметрыБазисов.Добавить();
		ЗаполнитьПараметрыБазиса(СтрокаБазиса, ТекСтрока.Базис);
	
	КонецЦикла;	
	
	Если Не Параметры.Ключ.Пустая() Тогда
	
		СправочникОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.ИнвестиционныеДекларации"));
		РедактированиеЗапрещено = СправочникОбъект.РедактированиеЗапрещено();
		
		Элементы.Показатели.ТолькоПросмотр 								= РедактированиеЗапрещено;
		Элементы.ЭмитентыТекущейГруппы.ТолькоПросмотр 					= РедактированиеЗапрещено;
		Элементы.ЦенныеБумагиТекущейГруппы.ТолькоПросмотр 				= РедактированиеЗапрещено;
		Элементы.СчетаДоверительногоУправления.ТолькоПросмотр 			= РедактированиеЗапрещено;
		Элементы.ТипИнвестиционнойДекларации.ТолькоПросмотр 			= РедактированиеЗапрещено;
		Элементы.СовокупныйКонтроль.ТолькоПросмотр 						= РедактированиеЗапрещено;
		Элементы.Консолидирующая.ТолькоПросмотр 						= РедактированиеЗапрещено;
		Элементы.ИспользоватьМинимальноеЗначениеРейтинга.ТолькоПросмотр = РедактированиеЗапрещено;
		Элементы.ИспользоватьЦелевоеЗначение.ТолькоПросмотр 			= РедактированиеЗапрещено;
		
		Элементы.ПоказателиПодбор.Доступность 	= Не РедактированиеЗапрещено;
		
		ИменаЭлементовТаблиц = СтрРазделить("ГруппыЭмитентов,ГруппыЦенныхБумаг", ",");
		Для каждого ИмяЭлемнта Из ИменаЭлементовТаблиц Цикл
		
			Элементы[ИмяЭлемнта].КоманднаяПанель.ПодчиненныеЭлементы[ИмяЭлемнта + "Добавить"].Доступность 		= Не РедактированиеЗапрещено;
			Элементы[ИмяЭлемнта].КоманднаяПанель.ПодчиненныеЭлементы[ИмяЭлемнта + "Удалить"].Доступность 		= Не РедактированиеЗапрещено;
			Элементы[ИмяЭлемнта].КоманднаяПанель.ПодчиненныеЭлементы[ИмяЭлемнта + "Скопировать"].Доступность 	= Не РедактированиеЗапрещено;
			Элементы[ИмяЭлемнта].КонтекстноеМеню.ПодчиненныеЭлементы[ИмяЭлемнта + "КонтекстноеМенюДобавить"].Доступность 	= Не РедактированиеЗапрещено;
			Элементы[ИмяЭлемнта].КонтекстноеМеню.ПодчиненныеЭлементы[ИмяЭлемнта + "КонтекстноеМенюУдалить"].Доступность 	= Не РедактированиеЗапрещено;
			Элементы[ИмяЭлемнта].КонтекстноеМеню.ПодчиненныеЭлементы[ИмяЭлемнта + "КонтекстноеМенюСкопировать"].Доступность = Не РедактированиеЗапрещено;
		
		КонецЦикла; 
		
		ЗаполнитьНесоответствияИД();
		
		Если Объект.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость Тогда
		
			ЗаполнитьИмяФайлаЛимитнойВедомости();
		
		КонецЕсли;		
		
	ИначеЕсли Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) И Не ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда 
		
		Объект.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация;
		
	КонецЕсли; 
	
	ПоляЗначений = СтрРазделить("МинимальноеЗначение,МаксимальноеЗначение", ",", Ложь);
	
	ЗаполнитьПараметрыПолейОтбора();
		
	Для каждого ТекСтрока Из Объект.Показатели Цикл
	
		Для каждого ПолеЗначения Из ПоляЗначений Цикл
			
			Если ТипЗнч(ТекСтрока[ПолеЗначения]) = Тип("Строка") Тогда
				ПараметрыБазиса = ПараметрыБазисов.НайтиСтроки(Новый Структура("Базис", ТекСтрока.Базис))[0]; 
				ПолеСКД = ПараметрыБазиса.ОтборКомпоновкиДанных.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ТекСтрока[ПолеЗначения]));
				ТекСтрока[ПолеЗначения + "Форма"] = ?(ПолеСКД = Неопределено, "", ПолеСКД.Заголовок);
			Иначе
				ТекСтрока[ПолеЗначения + "Форма"] = ТекСтрока[ПолеЗначения];
			КонецЕсли; 
		
		КонецЦикла; 
		
		ЗаполнитьИмяГруппы(ТекСтрока, ЭтаФорма.ПараметрыПолейЭмитентов);
		ЗаполнитьИмяГруппы(ТекСтрока, ЭтаФорма.ПараметрыПолейЦенныхБумаг);
		ЗаполнитьОтбор(ТекСтрока, ЭтаФорма.ПараметрыПолейЭмитентов);
		ЗаполнитьОтбор(ТекСтрока, ЭтаФорма.ПараметрыПолейЦенныхБумаг);
		ТекСтрока.ЗапретПокупки = ЗначениеЗаполнено(ТекСтрока.ДатаЗапретаПокупки);
		
		Если Параметры.Ключ.Пустая() Тогда
			ТекСтрока.ИдентификаторСтрокиПоказателей = Неопределено;
		КонецЕсли; 
	
	КонецЦикла; 
	
	Элементы.ПоказателиИнвестиционнаяДекларация.Видимость = Объект.Консолидирующая;
	
	ЭтаФорма.ОписаниеТиповМаксимальногоИМинимальногоЗначения = Метаданные.Справочники.ИнвестиционныеДекларации.ТабличныеЧасти.Показатели.Реквизиты.МинимальноеЗначение.Тип;
	
	РаботаСФормами.ЗагрузитьСписокШаблонов(ЭтаФорма, "УчастиеВГолосовании");
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиНастроекИзПодбора(АдресТаблицыПриемника)

	ТаблицаПриемник = ПолучитьИзВременногоХранилища(АдресТаблицыПриемника);
	УдалитьИзВременногоХранилища(АдресТаблицыПриемника);
	Для каждого СтрокаПриемник Из ТаблицаПриемник Цикл
		СтрокаПоказатель = Объект.Показатели.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоказатель, СтрокаПриемник);
		БазисПриИзмененииНаСервере(СтрокаПоказатель.Базис);
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура КонсолидирующаяПриИзменении(Элемент)
	Элементы.ПоказателиИнвестиционнаяДекларация.Видимость = Объект.Консолидирующая;
КонецПроцедуры

&НаКлиенте
Процедура МинимальноеЗначениеФормаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораЗначения("МинимальноеЗначение", СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура МаксимальноеЗначениеФормаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораЗначения("МаксимальноеЗначение", СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораЗначения(ПолеЗначения, СтандартнаяОбработка)

	ТекСтрока = Элементы.Показатели.ТекущиеДанные;
	Если ТипЗнч(ТекСтрока[ПолеЗначения + "Форма"]) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		НовоеЗначение = ОткрытьФормуМодально("Справочник.ИнвестиционныеДекларации.Форма.ФормаВыбораПоля", Новый Структура("Базис, ТекущееПоле", ТекСтрока.Базис, ТекСтрока[ПолеЗначения]));
		Если ТипЗнч(НовоеЗначение) = Тип("Структура") Тогда
			ТекСтрока[ПолеЗначения] = НовоеЗначение.Поле;
			ТекСтрока[ПолеЗначения + "Форма"] = НовоеЗначение.Заголовок;
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(ЭтаФорма)

	ЭтоЛимитнаяВедомость = (ЭтаФорма.Объект.ТипИнвестиционнойДекларации = ПредопределенноеЗначение("Перечисление.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость"));
	ЭтоЗаконодательныеОграничения = (ЭтаФорма.Объект.ТипИнвестиционнойДекларации = ПредопределенноеЗначение("Перечисление.ТипыИнвестиционныхДеклараций.ЗаконодательныеОграничения"));
	ЭтаФорма.Элементы.СтраницаСчетаДоверительногоУправления.Видимость = ЭтоЛимитнаяВедомость;
	ЭтаФорма.Элементы.СовокупныйКонтроль.Видимость = ЭтоЗаконодательныеОграничения;

КонецПроцедуры 

#КонецОбласти 

#Область Работа_с_шаблонами

&НаКлиенте
Процедура КомандаНастройкаШаблонов_Подключаемый(Команда)
	
	ИмяЭлемента	= СтрРазделить(Команда.Имя, "_")[1];
	Результат	= ОткрытьФормуМодально("ОбщаяФорма.ФормаСпискаШаблонов", Новый Структура("СписокШаблонов", ЭтаФорма["СписокШаблонов_" + ИмяЭлемента])); 
	
	Если ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
		СохранитьСписокШаблоновНаСервере(Результат, ИмяЭлемента);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере 
Процедура СохранитьСписокШаблоновНаСервере(СписокШаблонов, ИмяЭлемента)

	РаботаСФормами.СохранитьСписокШаблонов(ЭтаФорма, ИмяЭлемента, СписокШаблонов);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореШаблона_Подключаемый(Команда)
	
	РаботаСФормамиКлиент.ПриВыбореШаблона(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область Отборы

#Область Обработчики_элементов_отбор_по_эмитентам

&НаКлиенте
Процедура ПоказателиОтборПоЭмитентуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтборНачалоВыбора(Элемент, СтандартнаяОбработка, ЭтаФорма.ПараметрыПолейЭмитентов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиОтборПоЭмитентуОчистка(Элемент, СтандартнаяОбработка)
	
	ОтборОчистка(СтандартнаяОбработка, ЭтаФорма.ПараметрыПолейЭмитентов);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыЭмитентовПриАктивизацииСтроки(Элемент)
	
	ГруппаПриАктивизацииСтроки(Элемент, Элементы.ЭмитентыТекущейГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыЭмитентовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ГруппыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование, Объект.Эмитенты, Элементы.ЭмитентыТекущейГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыЭмитентовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ГруппыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Объект.Эмитенты);

КонецПроцедуры

&НаКлиенте
Процедура ГруппыЭмитентовПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
    ПроверитьСсылкиНаГруппу(ТекущиеДанные, ЭтаФорма.ПараметрыПолейЭмитентов, Отказ);
	
	Если Не Отказ Тогда
	
		ОчиститьСоставГруппы(ТекущиеДанные.Идентификатор, Объект.Эмитенты);
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСсылкиНаГруппу(ТекущиеДанные, ПараметрыПолей, Отказ)
	
	НайденныеСтроки = Объект.Показатели.НайтиСтроки(Новый Структура(ПараметрыПолей.ПолеГруппа, ТекущиеДанные.Идентификатор));
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Если НайденныеСтроки.Количество() = 1 Тогда
			
			Подстрока = "строке " + НайденныеСтроки[0].НомерСтроки;
			
		Иначе
			
			НомераСтрок = Новый Массив;
			
			Для каждого Строка Из НайденныеСтроки Цикл
				НомераСтрок.Добавить(Строка.НомерСтроки);
			КонецЦикла;
			
			Подстрока = "строках " + СтрСоединить(НомераСтрок, ", ");
			
		КонецЕсли;
		
		ТекстВопроса = СтрШаблон("Группа '%1' используется в %2. 
		|Ссылки будут очищены. Продолжить?", 
		ТекущиеДанные.Имя,
		Подстрока);
		
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.ОК Тогда
			Для каждого Строка Из НайденныеСтроки Цикл
				Строка[ПараметрыПолей.ПолеГруппа] = Неопределено;
				Строка[ПараметрыПолей.ПолеГруппаИмя] = "";
				Строка[ПараметрыПолей.ПолеОтбор] = "";
			КонецЦикла;
		Иначе 
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭмитентыТекущейГруппыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ЭлементыТекущейГруппыПриНачалеРедактирования(Элемент, НоваяСтрока, Элементы.ГруппыЭмитентов);

КонецПроцедуры

&НаКлиенте
Процедура ЭмитентыЭмитентПриИзменении(Элемент)
	
	ЭлементГруппыПриИзменении(ЭтаФорма.ПараметрыПолейЭмитентов); 
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_элементов_отбор_по_ценным_бумагам

&НаКлиенте
Процедура ПоказателиОтборПоЦеннымБумагамНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтборНачалоВыбора(Элемент, СтандартнаяОбработка, ЭтаФорма.ПараметрыПолейЦенныхБумаг)
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиОтборПоЦеннымБумагамОчистка(Элемент, СтандартнаяОбработка)
	
	ОтборОчистка(СтандартнаяОбработка, ЭтаФорма.ПараметрыПолейЦенныхБумаг);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыЦенныхБумагПриАктивизацииСтроки(Элемент)
	
	ГруппаПриАктивизацииСтроки(Элемент, Элементы.ЦенныеБумагиТекущейГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыЦенныхБумагПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ГруппыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование, Объект.ЦенныеБумаги, Элементы.ЦенныеБумагиТекущейГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыЦенныхБумагПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ГруппыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Объект.ЦенныеБумаги);

КонецПроцедуры

&НаКлиенте
Процедура ГруппыЦенныхБумагПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
    ПроверитьСсылкиНаГруппу(ТекущиеДанные, ЭтаФорма.ПараметрыПолейЦенныхБумаг, Отказ);
	
	Если Не Отказ Тогда
	
		ОчиститьСоставГруппы(ТекущиеДанные.Идентификатор, Объект.ЦенныеБумаги);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиТекущейГруппыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ЭлементыТекущейГруппыПриНачалеРедактирования(Элемент, НоваяСтрока, Элементы.ГруппыЦенныхБумаг);

КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиТекущейГруппыЦеннаяБумагаПриИзменении(Элемент)
	
	ЭлементГруппыПриИзменении(ЭтаФорма.ПараметрыПолейЦенныхБумаг);
	
КонецПроцедуры
#КонецОбласти 

#Область Общие_обработчики_элементов_отбора

&НаКлиенте
Процедура ОтборНачалоВыбора(Элемент, СтандартнаяОбработка, ПараметрыПолей)
	
	СтандартнаяОбработка = Ложь;
	
	СписокГрупп = Новый СписокЗначений;
	
	Для каждого СтрокаГруппы Из Объект[ПараметрыПолей.ТаблицаГруппы] Цикл
		СписокГрупп.Добавить(СтрокаГруппы.Идентификатор, СтрокаГруппы.Имя);
	КонецЦикла;
	
	ТекСтрока = Элементы.Показатели.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Элемент", ТекСтрока[ПараметрыПолей.ПолеЭлемент]);
	ПараметрыФормы.Вставить("Группа", ТекСтрока[ПараметрыПолей.ПолеГруппа]);
	Если ПараметрыПолей.Свойство("ПолеВключаяФилиалы") Тогда
		
		Если Не ЗначениеЗаполнено(ТекСтрока[ПараметрыПолей.ПолеЭлемент])
			И Не ЗначениеЗаполнено(ТекСтрока[ПараметрыПолей.ПолеГруппа]) Тогда
			ТекСтрока.ВключаяФилиалы = Истина;
		КонецЕсли; 
		
		ПараметрыФормы.Вставить("ВключаяФилиалы", ТекСтрока.ВключаяФилиалы);
		
	КонецЕсли;
	
	ПараметрыФормы.Вставить("СписокГрупп", СписокГрупп);
	ПараметрыФормы.Вставить("ПараметрыПолей", ПараметрыПолей);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Элементы.Показатели.ТолькоПросмотр);
	
	Результат = ОткрытьФормуМодально("Справочник.ИнвестиционныеДекларации.Форма.ФормаНастройкиОтбора", ПараметрыФормы, Элемент);
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ТекСтрока, Результат);
		
		ЗаполнитьОтбор(ТекСтрока, ПараметрыПолей);
		
		ЭтаФорма.Модифицированность = Истина;
		Элементы.Показатели.ТекущиеДанные.ИдентификаторСКДНабора = Неопределено;
	    
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОчистка(СтандартнаяОбработка, ПараметрыПолей)

	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.Показатели.ТекущиеДанные;
	
	ТекСтрока[ПараметрыПолей.ПолеЭлемент] = Неопределено;
	ТекСтрока[ПараметрыПолей.ПолеГруппа] = Неопределено;
	
	Если ПараметрыПолей.Свойство("ПолеВключаяФилиалы") Тогда
	
		ТекСтрока[ПараметрыПолей.ПолеВключаяФилиалы] = Неопределено;
	
	КонецЕсли; 
	
	ЗаполнитьОтбор(ТекСтрока, ПараметрыПолей);
	
	ЭтаФорма.Модифицированность = Истина;
	Элементы.Показатели.ТекущиеДанные.ИдентификаторСКДНабора = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПриАктивизацииСтроки(Элемент, ЭлементСоставГруппы)

	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ИдентификаторТекущейГруппы = Неопределено;
		ЭлементСоставГруппы.Доступность = Ложь;
	Иначе
		ИдентификаторТекущейГруппы = ТекущиеДанные.Идентификатор;
		ЭлементСоставГруппы.Доступность = Истина;
	КонецЕсли;
	
	Если ИдентификаторТекущейГруппы = Неопределено ИЛИ ЗначениеЗаполнено(ИдентификаторТекущейГруппы) Тогда	
		ЭлементСоставГруппы.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Группа", ИдентификаторТекущейГруппы));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование, Таблица, ПодчиненныйЭлемент)

	Если НоваяСтрока Тогда
		
		ИдентификаторНовойГруппы			= Новый УникальныйИдентификатор;
		ИдентификаторКопируемойГруппы		= Элемент.ТекущиеДанные.Идентификатор;
		Элемент.ТекущиеДанные.Идентификатор	= ИдентификаторНовойГруппы;
		
		Если Копирование Тогда			
			
			КопируемыеПараметры = Таблица.НайтиСтроки(Новый Структура("Группа", ИдентификаторКопируемойГруппы));
			
			Для Каждого СтрокаПараметров Из КопируемыеПараметры Цикл
				
				НоваяСтрокаПараметров = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПараметров, СтрокаПараметров, , "Группа");
				НоваяСтрокаПараметров.Группа = ИдентификаторНовойГруппы;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ПодчиненныйЭлемент.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Группа", ИдентификаторНовойГруппы));	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Таблица)

	Если НоваяСтрока И ОтменаРедактирования Тогда
		ОчиститьСоставГруппы(Элемент.ТекущиеДанные.Идентификатор, Таблица);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСоставГруппы(ИдентификаторГруппы, Таблица)
	
	Для Инд = 1 - Таблица.Количество() По 0 Цикл
		Если Таблица[-Инд].Группа = ИдентификаторГруппы Тогда
			Таблица.Удалить(-Инд);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЭлементыТекущейГруппыПриНачалеРедактирования(Элемент, НоваяСтрока, ЭлементГруппы)

	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Группа = ЭлементГруппы.ТекущиеДанные.Идентификатор;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭлементГруппыПриИзменении(ПараметрыПолей)

	ТекСтрока = Элементы[ПараметрыПолей.ТаблицаЭлементов].ТекущиеДанные;
	СтрокиПоГруппе = Объект.Показатели.НайтиСтроки(Новый Структура(ПараметрыПолей.ПолеГруппа, ТекСтрока.Группа));
	Для каждого Строка Из СтрокиПоГруппе Цикл
		Строка.ИдентификаторСКДНабора = Неопределено;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

&НаСервере
Процедура ЗаполнитьПараметрыПолейОтбора()

	ЭтаФорма.ПараметрыПолейЭмитентов = Новый Структура;
	ЭтаФорма.ПараметрыПолейЭмитентов.Вставить("ПолеЭлемент", 		"Эмитент");
	ЭтаФорма.ПараметрыПолейЭмитентов.Вставить("ПолеГруппа", 		"ГруппаЭмитентов");
	ЭтаФорма.ПараметрыПолейЭмитентов.Вставить("ПолеГруппаИмя", 		"ГруппаЭмитентовИмя");
	ЭтаФорма.ПараметрыПолейЭмитентов.Вставить("ПолеОтбор", 			"ОтборПоЭмитенту");
	ЭтаФорма.ПараметрыПолейЭмитентов.Вставить("ПолеВключаяФилиалы", "ВключаяФилиалы");
	ЭтаФорма.ПараметрыПолейЭмитентов.Вставить("ТаблицаГруппы", 		"ГруппыЭмитентов");
	ЭтаФорма.ПараметрыПолейЭмитентов.Вставить("ТаблицаЭлементов", 	"ЭмитентыТекущейГруппы");
	
	ЭтаФорма.ПараметрыПолейЦенныхБумаг = Новый Структура;
	ЭтаФорма.ПараметрыПолейЦенныхБумаг.Вставить("ПолеЭлемент", 		"ЦеннаяБумага");
	ЭтаФорма.ПараметрыПолейЦенныхБумаг.Вставить("ПолеГруппа", 		"ГруппаЦенныхБумаг");
	ЭтаФорма.ПараметрыПолейЦенныхБумаг.Вставить("ПолеГруппаИмя", 	"ГруппаЦенныхБумагИмя");
	ЭтаФорма.ПараметрыПолейЦенныхБумаг.Вставить("ПолеОтбор", 		"ОтборПоЦеннойБумаге");
	ЭтаФорма.ПараметрыПолейЦенныхБумаг.Вставить("ТаблицаГруппы", 	"ГруппыЦенныхБумаг");
	ЭтаФорма.ПараметрыПолейЦенныхБумаг.Вставить("ТаблицаЭлементов", "ЦенныеБумагиТекущейГруппы");
	
КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьОтбор(ТекСтрока, ПараметрыПолей)

	ПолеЭлемент = ТекСтрока[ПараметрыПолей.ПолеЭлемент];
	ПолеГруппа = ТекСтрока[ПараметрыПолей.ПолеГруппа];
	ПолеГруппаИмя = ТекСтрока[ПараметрыПолей.ПолеГруппаИмя];
	
	Если ЗначениеЗаполнено(ПолеЭлемент) Или ЗначениеЗаполнено(ПолеГруппа) Тогда
		ТекСтрока[ПараметрыПолей.ПолеОтбор] = ?(ЗначениеЗаполнено(ПолеЭлемент), Строка(ПолеЭлемент), "Группа " + ПолеГруппаИмя);		
	Иначе
		ТекСтрока[ПараметрыПолей.ПолеОтбор] = "";
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьИмяГруппы(ТекСтрока, ПараметрыПолей)

	ПолеГруппа = ТекСтрока[ПараметрыПолей.ПолеГруппа];
	ТаблицаГруппы = Объект[ПараметрыПолей.ТаблицаГруппы];
	
	Если ЗначениеЗаполнено(ПолеГруппа) Тогда
		// определим имя группы
		ГруппыЭлементовПоИдентификатору = ТаблицаГруппы.НайтиСтроки(Новый Структура("Идентификатор", ПолеГруппа));
		
		Если ГруппыЭлементовПоИдентификатору.Количество() > 0 Тогда
			ТекСтрока[ПараметрыПолей.ПолеГруппаИмя] = ГруппыЭлементовПоИдентификатору[0].Имя;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказателиЗапретПокупкиПриИзменении(Элемент)
	
	ТекДанные = Элементы.Показатели.ТекущиеДанные;
	Если Не ТекДанные.ЗапретПокупки Тогда
		ТекДанные.ДатаЗапретаПокупки = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиДатаЗапретаПокупкиПриИзменении(Элемент)
	
	ТекДанные = Элементы.Показатели.ТекущиеДанные;
	ТекДанные.ЗапретПокупки = ЗначениеЗаполнено(ТекДанные.ДатаЗапретаПокупки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЭтаФорма.ИмяФайлаЛимитнойВедомости) Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&Объект КАК Объект,
			|	ДополнительныеСведения.Ссылка КАК Свойство,
			|	&ИмяФайлаЛимитнойВедомости КАК Значение
			|ИЗ
			|	ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
			|ГДЕ
			|	ДополнительныеСведения.Ключ = ""Справочник.ИнвестиционныеДекларации.ИмяФайлаЛимитнойВедомости""";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Объект", ТекущийОбъект.Ссылка);
		Запрос.УстановитьПараметр("ИмяФайлаЛимитнойВедомости", ЭтаФорма.ИмяФайлаЛимитнойВедомости);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
		
			Запись = РегистрыСведений.ЗначенияДополнительныхСведений.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Записать();			
		
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИмяФайлаЛимитнойВедомости()

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеСведения.Ключ КАК Ключ,
		|	ДополнительныеСведения.Ссылка КАК Свойство,
		|	ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, НЕОПРЕДЕЛЕНО) КАК Значение
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО (ЗначенияДополнительныхСведений.Свойство = ДополнительныеСведения.Ссылка)
		|			И (ЗначенияДополнительныхСведений.Объект = &Объект)
		|ГДЕ
		|	ДополнительныеСведения.Ключ = ""Справочник.ИнвестиционныеДекларации.ИмяФайлаЛимитнойВедомости""";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		ЭтаФорма.ИмяФайлаЛимитнойВедомости = Выборка.Значение;
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Показатели.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ Показатели
		|ИЗ
		|	&Показатели КАК Показатели
		|ГДЕ
		|	Показатели.ЗапретПокупки
		|	И Показатели.ДатаЗапретаПокупки = ДАТАВРЕМЯ(1, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Показатели.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Показатели КАК Показатели";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Показатели", Объект.Показатели.Выгрузить(, "НомерСтроки, ЗапретПокупки, ДатаЗапретаПокупки"));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = СтрШаблон("В строке №%1 не заполнена дата запрета покупки", Выборка.НомерСтроки);
		Поле = СтрШаблон("Объект.Показатели[%1].ЗапретПокупки", Выборка.НомерСтроки - 1);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, Поле,, Отказ); 
	
	КонецЦикла;
	
КонецПроцедуры
 

#КонецОбласти
